label bai_final_section:
    scene bg 24
    "思绪回到现在（五百年后），你从玉钗中获取的记忆已了然于心，你现在终于知道自己屡屡突破失败的原因。"
    xiaobai "最后一刻我保住了他的魂魄。"
    show xiaoqing
    xiaoqing "但珠钗发动，你的功力全失，化回白蛇。我是用尽了最后一丝气力将这些记忆封印在了珠钗之中，今日你终于又打开了。"
    xiaobai "记忆能打开，正果还是不能修得，还是不能解脱，一时欢情，我记了五百年。他魂魄犹在，定是投胎转世，到世间的某处了，我要找到他。"
    hide xiaoqing with dissolve
    scene bg 23
    "一天上午，春雨蒙蒙，你和小青走在桥上，有意落下那支珠钗。"
    show young_man
    young_man "姑娘，你的珠钗掉了。"
    xiaobai "谢谢官人。"
    young_man "这珠钗年代久远，可是宝贵之物"
    xiaobai "是啊，多谢小官人捡到。这可是万万不能丢失的。"
    young_man "小娘子看着好生面善，是何方之人。"
    xiaobai "说来话长..."
    hide young_man with dissolve
    scene bg 2 with dissolve
    scene bg 1
    "故事到这就结束了，你再次感到一阵眩晕，随后发现自己回到了家里。电视之中正播放着下一个春晚节目，而你的思绪却仍停在白蛇的故事中，久久不能释怀。"
    "你似乎收益良多，阿宣和小白的爱情跨越了种族的界限，展示了爱情的力量可以超越一切障碍；"
    "那句“人间多的是长着两只脚的恶人，长了条尾巴又怎么样。”道出人妖并非是乱世对立的根源，善与恶才是；"
    "虽然小白和许宣的命运充满了坎坷，但他们通过自己的选择和努力，最终改变了自己的命运。"
    "那么聪明的你，还收获了哪些“宝藏”呢？"

    return