label xu_final_section:
    "一天上午，春雨蒙蒙，你正走在桥上，看到两位姑娘落下了一支珠钗，二人一位身着白衣，飘逸如仙，另一位身穿绿裙，灵动潇洒。"
    
    menu:
        "收下珠钗，据为己有。":
            "你不动声色的拿走了珠钗，没有想着还给失主，只是在思考这只珠钗能换多少钱，也许对你来说，这也是一份有价值的宝藏吧，但是冥冥之中，你感觉自己好像失去了什么重要的东西，不过，那也与你无关了。"
            jump xu_final_one
        "拾起珠钗，物归原主。":
            young_man "姑娘，你的珠钗掉了。"
            xiaobai "谢谢官人。"
            young_man "这珠钗年代久远，可是宝贵之物"
            xiaobai "是啊，多谢小官人捡到。这可是万万不能丢失的。"
            young_man "小娘子看着好生面善，是何方之人。"
            xiaobai "说来话长..."
            jump xu_final_one
    label xu_final_one:
    "故事到这就结束了，你再次感到一阵眩晕，随后发现自己回到了家里。电视之中正播放着下一个春晚节目，而你的思绪却仍停在白蛇的故事中，久久不能释怀。"

    "你似乎收益良多，阿宣和小白的爱情跨越了种族的界限，展示了爱情的力量可以超越一切障碍；"
    "那句“人间多的是长着两只脚的恶人，长了条尾巴又怎么样。”道出人妖并非是乱世对立的根源，善与恶才是；"
    "虽然小白和许宣的命运充满了坎坷，但他们通过自己的选择和努力，最终改变了自己的命运。"

    "那么聪明的你，还收获了哪些“宝藏”呢？"

    return  