label xu_third_section:
    "你和小白小心翼翼地踏入了地宫深处，四周昏暗，只有墙壁上的火把发出微弱的光芒。"
    axuan "跟我来，小白，我们得小心，这里可能有未知的危险。"
    xiaobai "小心，阿宣，这里有蹊跷，我们不能大意。"
    "你们沿着石阶向下，发现了一条隐藏的密道。"
    axuan "真没想到，这地宫底下，还有这么一条密道，我们得想办法出去。"
    xiaobai "我们从这里走，看看能不能找到出路。"
    "你们走进了密道，发现了一个复杂的机关阵列。"
    axuan "朱雀在顶，玄武入宫，宫为内卦，门为外卦，八门……这边是生门，我们走这边。"
    axuan "经过一番寻找，你们找到了生门，继续前进。"
    xiaobai "这是什么地方？"
    axuan "看来是藏在地下的一个镇妖法阵，不过对人无害。"
    "你们继续探索，发现了一个古老的道家机关。"
    axuan "这地底下怎么会有一个道家机关呢？想必原来是一个道观，荒废了，后来又在上面建了一座塔。"
    xiaobai "没事，这个阵势有迹可循，我们一定能出去。"
    "你开始研究机关，你发现这个阵势像是一幅杂乱的文字石碑，又许多个可移动的小石块组成。"
    "经过尝试，你终于复原了这个石碑，只见石碑上写着："
    "天地玄宗 万炁本根"
    "精怪亡形 广修亿劫"
    "证吾神通 鬼妖丧胆"
    "诛妖除魔 灭形灭神"
    "看到这些文字，你不明所以，但是看见小白神色异常，便知道她似乎明白石碑上的内容。"
    xiaobai "阿宣，妖生来就要被赶尽杀绝吗？"
    axuan "天天诛妖除魔，逼我们捕蛇。天下已经乱成这样了，只看到越诛妖除魔，天下越乱。"
    axuan "小白，无论怎样有我在。"
    "由于你复原了石板，地宫的出口也打开了，你和小白走了出去，看到了等在一旁的小青，只见她脸上的愤怒已然消失不见，想必是冷静了下来。"
    "值得一提的是，肚兜作为“人质”，被小青踩在了脚下，看见你们出来，她向小白露出期待的目光。"
    xiaobai "小青，我想通了，我跟你走。"
    xiaobai "阿宣，我们就分开吧。"
    axuan "为什么？"
    xiaobai "天道无情，天地有规矩，有很多不想做，但不得不做的事。你是人，我是妖，人妖两途。你说过，有些事，记得不如忘了好。"
    "你的心中充满了不舍和无奈，你知道这次离开可能意味着永远的分别，但你也明白，为了小青，为了妖族，你必须做出选择。但是“人妖两途”这四个字深深刺痛了你的心，你的内心似乎有了解决这个问题的办法。"
    
    menu xu_third_one:
        "失望离开，放弃小白。":
            "你没有了办法，只能灰溜溜的返回捕蛇村，继续日复一日的生活。不知过了多少天，一条白蛇的巨蛇袭击了你的村子，无数村民流离失所，死于非命，你也在这场灾难中丧命。"
            jump xu_third_one
        "寻求帮助，化身为妖。":
            "你突然想起不久前见过的坊主，她曾说过她对于“移花接木，改变乾坤之事”十分感兴趣，想必她一定有办法让你变成妖。"
            axuan "你说得对，人妖两途，天道无情，但你我之间是有的。我一定会有办法的，我会回来的，等我。"
    "小白和小青的身影渐渐消失在远方，而你和肚兜也踏上了另一条道路。"

    jump xu_forth_section